       IDENTIFICATION DIVISION.
       PROGRAM-ID. QR.
       PROCEDURE DIVISION.
           DISPLAY "https://api.qrserver.com/v1/create-qr-code/?data=https://example.com&size=240x240".
           STOP RUN.
